projetinho_2/app/controllers/cities_controller.rb

INSERT INTO "cities" ("description", "code", "image", "created_at", "updated_at", "state_id") VALUES (?, ?, ?, ?, ?, ?)  [["description", "Chapecó"], ["code", 9506800000], ["image", ""], ["created_at", "2022-08-31 00:46:38.105481"], ["updated_at", "2022-08-31 00:46:38.105481"], ["state_id", 23]]
---
  def create
    @city = City.new(city_params)

    respond_to do |format|
      if @city.save

UPDATE "cities" SET "image" = ?, "updated_at" = ? WHERE "cities"."id" = ?  [["image", "http://t1.gstatic.com/licensed-image?q=tbn:ANd9GcQpdFlf8yGILDhLL83DFuQhde8WQ7b-EgBF5dOiFkzGwnIKxQTqjCLDEiiVRSMe1an3"], ["updated_at", "2022-08-24 00:45:16.246377"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @city.update(city_params)

DELETE FROM "cities" WHERE "cities"."id" = ?  [["id", 2]]
---
  def destroy
    @city.destroy

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_city
      @city = City.find(params[:id])

SELECT "states"."description", "states"."id" FROM "states"
---
    def set_state_options
      @state_options = State.all.pluck(:description, :id)